# Low achieving 15-year-olds in PISA test

![description](giphy-copy.gif)

Hi Karishma, can you read this?

Yes, help me!

Great, Christina can you also read this?

Yes I can!

In [ ]:
import pandas as pd 
# importing the pandas library for data cleaning and using pd as an alias

In [ ]:
df = pd.read_csv(r'/Users/mac/Downloads/sdg_04_40_linear.csv')
# using the read_csv function from pandas library to read the file into a dataframe (pandas specific data type)

In [ ]:
#df.columns
columns_to_drop = ['DATAFLOW', 'LAST UPDATE', 'freq','sex', 'unit', 'CONF_STATUS'] 
#creating a list of columns that need to be dropped

In [ ]:
df = df.drop(columns=columns_to_drop,axis = 1)
# using the drop function to remove them from the dataframe

In [5]:
print(df)

           field            geo  TIME_PERIOD  OBS_VALUE OBS_FLAG
0        Reading        Albania         2000       70.4      NaN
1    Mathematics        Albania         2009       67.7      NaN
2        Reading        Albania         2009       56.7        b
3        Science        Albania         2009       57.3      NaN
4    Mathematics        Albania         2012       60.7      NaN
..           ...            ...          ...        ...      ...
774      Reading  United States         2018       19.3        b
775      Science  United States         2018       18.6      NaN
776  Mathematics  United States         2022       33.9      NaN
777      Reading  United States         2022       20.1      NaN
778      Science  United States         2022       21.9      NaN

[779 rows x 5 columns]

In [ ]:
df = df[df['TIME_PERIOD']>=2006]
# only saving the records from 2006

In [7]:
print(df)

           field            geo  TIME_PERIOD  OBS_VALUE OBS_FLAG
1    Mathematics        Albania         2009       67.7      NaN
2        Reading        Albania         2009       56.7        b
3        Science        Albania         2009       57.3      NaN
4    Mathematics        Albania         2012       60.7      NaN
5        Reading        Albania         2012       52.3      NaN
..           ...            ...          ...        ...      ...
774      Reading  United States         2018       19.3        b
775      Science  United States         2018       18.6      NaN
776  Mathematics  United States         2022       33.9      NaN
777      Reading  United States         2022       20.1      NaN
778      Science  United States         2022       21.9      NaN

[697 rows x 5 columns]

In [ ]:
df[df['OBS_VALUE'].isnull()][['field','geo','TIME_PERIOD','OBS_VALUE']]
# gathering a list of records whose score is null

       field              geo  TIME_PERIOD  OBS_VALUE
22   Reading          Austria         2009        NaN
93   Reading           Cyprus         2009        NaN
394  Reading    Liechtenstein         2009        NaN
395  Reading    Liechtenstein         2018        NaN
483  Reading  North Macedonia         2009        NaN
680  Reading            Spain         2018        NaN

In [ ]:
countries_null = df[df['OBS_VALUE'].isnull()][['field','geo','TIME_PERIOD','OBS_VALUE']]
# saving countries with null scores to a variable

The data has been cleaned and stored in the variable df